-- примерное заполнение таблицы option_scores
INSERT INTO option_scores (id, option_id, score_type_id, weight)
VALUES
    -- Варианты для вопроса "Как срочно нужен человек?" (option_id 1–4)

    -- Срочность
    (1, 1, 4, 10),
    (2, 2, 4, 5),
    (3, 3, 4, 3),
    (4, 4, 4, -5),

    -- Как часто
    (5, 5, 1, 3),
    (6, 6, 1, 2),
    (7, 7, 1, 0),
    (8, 8, 1, -2),
    (9, 5, 2, -2),
    (10, 6, 2, 0),
    (11, 7, 2, 5),
    (12, 8, 2, 10),
    (13, 5, 5, -2),
    (14, 6, 5, 3),
    (15, 7, 5, 5),
    (16, 8, 5, 7),

    -- Время на самостоятельный поиск
    (17, 9, 1, -1),
    (18, 10, 1, 3),
    (19, 11, 1, 6),
    (20, 12, 1, 0),
    (21, 9, 2, 10),
    (22, 10, 2, 5),
    (23, 11, 2, 2),
    (24, 12, 2, 0);
