export interface Profession {
  id: string;
  name: string;
  items?: Profession[];
}

export const professions: Profession[] = [
  {
    id: "19",
    name: "Автомобильный бизнес",
    items: [
      { id: "4", name: "Автомойщик" },
      { id: "5", name: "Автослесарь, автомеханик" },
      { id: "62", name: "Мастер-приемщик" },
      { id: "70", name: "Менеджер по продажам, менеджер по работе с клиентами" }
    ]
  },
  {
    id: "5",
    name: "Административный персонал",
    items: [
      { id: "8", name: "Администратор" },
      { id: "33", name: "Делопроизводитель, архивариус" },
      { id: "58", name: "Курьер" },
      { id: "76", name: "Менеджер/руководитель АХО" },
      { id: "84", name: "Оператор ПК, оператор базы данных" },
      { id: "88", name: "Офис-менеджер" },
      { id: "93", name: "Переводчик" },
      { id: "110", name: "Секретарь, помощник руководителя, ассистент" }
    ]
  },
  {
    id: "15",
    name: "Безопасность",
    items: [
      { id: "22", name: "Военнослужащий" },
      { id: "90", name: "Охранник" },
      { id: "95", name: "Полицейский" },
      { id: "116", name: "Специалист по информационной безопасности" },
      { id: "120", name: "Специалист службы безопасности" }
    ]
  },
  {
    id: "26",
    name: "Высший и средний менеджмент",
    items: [
      { id: "26", name: "Генеральный директор, исполнительный директор (CEO)" },
      { id: "36", name: "Директор по информационным технологиям (CIO)" },
      { id: "37", name: "Директор по маркетингу и PR (CMO)" },
      { id: "38", name: "Директор по персоналу (HRD)" },
      { id: "166", name: "Директор юридического департамента (CLO)" },
      { id: "53", name: "Коммерческий директор (CCO)" },
      { id: "80", name: "Начальник производства" },
      { id: "87", name: "Операционный директор (COO)" },
      { id: "157", name: "Руководитель отдела аналитики" },
      { id: "172", name: "Руководитель отдела логистики" },
      { id: "170", name: "Руководитель отдела маркетинга и рекламы" },
      { id: "171", name: "Руководитель отдела персонала" },
      { id: "161", name: "Руководитель филиала" },
      { id: "125", name: "Технический директор (CTO)" },
      { id: "135", name: "Финансовый директор (CFO)" }
    ]
  },
  {
    id: "11",
    name: "Информационные технологии",
    items: [
      { id: "156", name: "BI-аналитик, аналитик данных" },
      { id: "160", name: "DevOps-инженер" },
      { id: "10", name: "Аналитик" },
      { id: "12", name: "Арт-директор, креативный директор" },
      { id: "150", name: "Бизнес-аналитик" },
      { id: "25", name: "Гейм-дизайнер" },
      { id: "165", name: "Дата-сайентист" },
      { id: "34", name: "Дизайнер, художник" },
      { id: "36", name: "Директор по информационным технологиям (CIO)" },
      { id: "73", name: "Менеджер продукта" },
      { id: "155", name: "Методолог" },
      { id: "96", name: "Программист, разработчик" },
      { id: "164", name: "Продуктовый аналитик" },
      { id: "104", name: "Руководитель группы разработки" },
      { id: "157", name: "Руководитель отдела аналитики" },
      { id: "107", name: "Руководитель проектов" },
      { id: "112", name: "Сетевой инженер" },
      { id: "113", name: "Системный администратор" },
      { id: "148", name: "Системный аналитик" },
      { id: "114", name: "Системный инженер" },
      { id: "116", name: "Специалист по информационной безопасности" },
      { id: "121", name: "Специалист технической поддержки" },
      { id: "124", name: "Тестировщик" },
      { id: "125", name: "Технический директор (CTO)" },
      { id: "126", name: "Технический писатель" }
    ]
  }
]; 